{
    "collect_on": "2024-05-13 14:29:48",
    "Break the Silence Peer Educators": "Break the Silence or BTS is a peer education organization whose mission is to prevent gender violence through healthy sexuality education. BTS facilitates trainings and plans larger campus wide events on topics such as sexuality education, consent, sex communication, bystander intervention, relationships, and gender based violence. Their goal is to center survivors and make their peers feel comfortable, empowered, and educated so that sexuality and pleasure can become part of everyday conversations.Website: https://studentaffairs.lehigh.edu/content/break-silence Contact: inssie@lehigh.edu 610-758-1303 Timeline: Apply by September 30, 2023Cost/Funding: No cost/funded through the SSIE office, academic credit can be offered for a WGSS internshipCreditYesCredit InfoWGSS internship availableDeadline to ApplySeptember 30, 2023Work Study OfferedNoFinancial Aid AvailableNoGPA Minimum RequiredNoPeriodFallSpringSummerWinterCollegeCollege of Arts and SciencesCollege of BusinessCollege of HealthP.C. Rossin College of Engineering & Applied ScienceIntercollegiate ProgramsEligibilityFirst YearSophomoreJuniorGraduate StudentOpportunity TypeCommunity EngagementLeadership DevelopmentPeer MentoringResearchFunding / CompensationAcademic CreditNo CompensationVolunteer",
    "Campus Sustainable Impact Fellowship": "Campus Sustainable Impact Fellows are a cohort of undergraduate and graduate students who address challenges related to the UN Sustainable Development Goals on Lehigh's campus. CSIFs advance their projects in the Spring and Fall semesters and have the option of working on their project in the summer at Mountaintop. The courses, workshops, retreats, and immersive experiences of this program integrate experiential learning, research, and entrepreneurial engagement with students leading original and ambitious projects with partners on campus and across the region. Projects are mentored by Lehigh faculty with students making substantial intellectual contributions along the way.Website: https://creativeinquiry.lehigh.edu/mountaintop-programs/campus-sustainable-impact-fellowshipContact: Bill Whitney, wrw210@lehigh.eduTimeline: Application deadline is 11:59pm ET on Sunday, October 29th. Two semesters (Spring followed by Fall). 3 Academic Credits per semester for two semesters. Cost/Funding: No cost to students CreditYesDeadline to ApplyOctober 29, 2023Application LinkImpact Fellowship 2024 ApplicationWork Study OfferedNoFinancial Aid AvailableNoGPA Minimum RequiredNoPeriodFallSpringCollegeCollege of Arts and SciencesCollege of EducationCollege of BusinessCollege of HealthP.C. Rossin College of Engineering & Applied ScienceIntercollegiate ProgramsEligibilityFirst YearSophomoreJuniorSeniorGraduate StudentOpportunity TypeCommunity EngagementCreative InquiryEntrepreneurshipResearchFunding / CompensationAcademic Credit",
    "CCPD Career Intern": "Your role as a Career Intern (CI) would be to support the CCPD mission to provide career education and connections that support student success. CCPD collaborates with students, campus leaders, alumni, parents, employer partners and key volunteers to create a campus ecosystem that supports a forward thinking strategic direction to enhance Lehigh’s national brand in career and professional development. The CI’s primary roles will be to serve as ambassadors of CCPD across campus and to educate students on various career related skills.Website: https://careercenter.lehigh.edu/Contact: Christine Russell (car617@Lehigh.edu) / Anna Bateman (anna.bateman@lehigh.edu)Timeline: Apply in March-April (yearly)Cost/Funding: Hourly PayCreditNoDurationFall and spring semestersWork Study OfferedNoFinancial Aid AvailableNoGPA Minimum RequiredYesGPA Requirement2.80PeriodFallSpringEligibilityFirst YearSophomoreJuniorSeniorGraduate StudentOpportunity TypeCommunity EngagementLeadership DevelopmentPeer MentoringFunding / CompensationHourly Pay",
    "Clare Boothe Luce Research Scholars Program": "Clare Boothe Luce (CBL) Research Scholars are a prestigious group of women undergraduates of the P.C. Rossin College of Engineering and Applied Science who endeavor to participate in impactful, hands-on undergraduate research. A rigorous selection process identifies high-achieving women engineers to become CBL Research Scholars for up to a two-year period.Website: https://engineering.lehigh.edu/academics/undergraduate/special-opportunities/clare-boothe-luceContact: Sabrina Jedlicka ssj207@lehigh.edu Timeline: Application due mid-March. 2 year time commitment, including one 10-week summer session of researchCost/Funding: Full-time summer (10-week) fellowships of $450yuhjhfddgouhihjbghkbjl per week; Part-time (6-10 hours a week) academic year research grants of $2,000;Annual research accounts up to $1,500 for lab fees and supplies; and, Optional travel funds (up to $700 per Scholar)CreditYesDeadline to ApplyFebruary 14, 2024Work Study OfferedNoFinancial Aid AvailableNoGPA Minimum RequiredYesGPA Requirement3.30PeriodFallSpringSummerCollegeP.C. Rossin College of Engineering & Applied ScienceIntercollegiate ProgramsEligibilityFirst YearSophomoreJuniorOpportunity TypeCreative InquiryResearchFunding / CompensationStipendAcademic CreditFunded Expenses",
    "Eco-Rep Leadership Program": "The Eco-Rep Leadership Program is a peer-to-peer education program focused on training student leaders to embody and promote sustainable living in residential halls and Greek houses. Through fun and educational programs, Eco-Reps foster sustainable behavior change among their peers and help build a campus community for the 21st Century.Website: https://sustainability.lehigh.edu/erlpContact: ecoreps@lehigh.eduTimeline: Apply in March for following year  Cost/Funding: No cost to students, stipend provided  CreditNoDeadline to ApplyMarch 10, 2024Application LinkEco-Rep Leadership Program Application 2024-2025Work Study OfferedNoFinancial Aid AvailableNoGPA Minimum RequiredNoPeriodFallSpringCollegeCollege of Arts and SciencesCollege of BusinessCollege of HealthP.C. Rossin College of Engineering & Applied ScienceIntercollegiate ProgramsEligibilityFirst YearSophomoreJuniorSeniorOpportunity TypeLeadership DevelopmentPeer MentoringFunding / CompensationStipend",
    "EUREKA! Venture Program": "The Joan F. & John M. Thalheimer '55 EUREKA! Venture Program is the Baker Institute's signature initiative in support of student venture founders from idea to product, service, and business model development - and all the steps in between.Website: https://www.lehighbakerinstitute.com/eurekaContact: bakerinfo@lehigh.eduTimeline: Monthly pitch nights can be found at https://www.lehighbakerinstitute.com in the calendar section at the bottom of the page. Cost/Funding: Mentorship and financial awards given, no cost  CreditNoWork Study OfferedNoFinancial Aid AvailableNoGPA Minimum RequiredYesGPA Requirement2.00PeriodFallSpringSummerCollegeCollege of Arts and SciencesCollege of BusinessCollege of HealthP.C. Rossin College of Engineering & Applied ScienceIntercollegiate ProgramsEligibilityFirst YearSophomoreJuniorSeniorGraduate StudentOpportunity TypeEntrepreneurshipLeadership DevelopmentFunding / CompensationFunded Expenses",
    "Flight45 Athletics Leadership ": "Flight45 is a comprehensive and integrated effort to educate, promote, develop and inspire leadership within the Lehigh Athletics community. Website: https://lehighsports.com/feature/flight45 Contact: Julie Ammary, Director of Athletics Leadership Development & Cait Gillard, Assistant Director of Athletics Leadership Development Timeline: Apply by November 1, 2023 for Summer 2024 Cost/Funding: No cost to students CreditNoWork Study OfferedNoFinancial Aid AvailableNoGPA Minimum RequiredNoPeriodSummerWinterFallSpringCollegeCollege of Arts and SciencesCollege of EducationCollege of BusinessCollege of HealthP.C. Rossin College of Engineering & Applied ScienceIntercollegiate ProgramsEligibilityFirst YearSophomoreJuniorSeniorGraduate StudentOpportunity TypePeer MentoringLeadership DevelopmentFunding / CompensationNo Compensation",
    "Global Social Impact Fellowship": "Global Social Impact Fellows are a cohort of undergraduate and graduate students who address sustainable development challenges in low-resource countries. GSIFs advance their projects in the Spring and Fall semesters, and in the summer, travel for 2-3 weeks of fieldwork. The courses, workshops, retreats, and immersive experiences of this program integrate experiential learning, research, and entrepreneurial engagement with students leading original and ambitious projects with in-country partners in diverse countries. Projects are mentored by Lehigh faculty with students making substantial intellectual contributions along the way.Website: https://creativeinquiry.lehigh.edu/impact-fellowships/global-social-impact-fellowshipContact: Bill Whitney, wrw210@lehigh.eduTimeline: Application deadline is 11:59pm ET on Sunday, October 29th. Program runs for two semesters (Spring followed by Fall) plus summer fieldwork.Cost/Funding: Approx. $1500 needed for fieldwork - financial assistance is available and offered to nearly all students. 3 Academic Credits per semester for two semesters. CreditYesDeadline to ApplyOctober 29, 2023Application LinkImpact Fellowship 2024 ApplicationWork Study OfferedNoFinancial Aid AvailableYesGPA Minimum RequiredNoPeriodFallSpringSummerCollegeCollege of Arts and SciencesCollege of EducationCollege of BusinessCollege of HealthP.C. Rossin College of Engineering & Applied ScienceIntercollegiate ProgramsEligibilityFirst YearSophomoreJuniorSeniorGraduate StudentOpportunity TypeCommunity EngagementCreative InquiryEntrepreneurshipGlobal & Cross CulturalResearchFunding / CompensationAcademic CreditFunded Expenses",
    "Iacocca International Internship Program": "The Iacocca International Internship Program is a mostly-funded opportunity to live and work in another country over the summer and is open to all undergraduate students from all disciplines. Participation begins in January and ends in September, and the travel dates are 6-10 weeks over the summer. Wrap-around curriculum enables student-guided learning and peer-to-peer support. Students who are interested in enhancing their career readiness and developing intercultural competency are encouraged to apply.Website: https://global.lehigh.edu/internships Contact: inliii@lehigh.eduTimeline: Apply by November 1, 2023 for Summer 2024 Cost/Funding: This is a mostly-funded experience, including airfare, housing and most meals. Students are responsible for passport and visa (where applicable) fees, innoculations (if needed), as well as some meals and any additional travel they want to do beyond the internship experience. CreditYesCredit InfoMostly non-credit bearing, although some internship placements include coursework (3 credits), which is paid by IIIPDeadline to ApplyNovember 1, 2023Work Study OfferedNoFinancial Aid AvailableYesGPA Minimum RequiredNoPeriodSpringSummerCollegeCollege of Arts and SciencesCollege of BusinessCollege of HealthP.C. Rossin College of Engineering & Applied ScienceIntercollegiate ProgramsEligibilityFirst YearSophomoreJuniorSeniorOpportunity TypeArtsCommunity EngagementCreative InquiryEntrepreneurshipGlobal & Cross CulturalLeadership DevelopmentPeer MentoringResearchWork-Integrated LearningFunding / CompensationStipendAcademic CreditFunded Expenses",
    "Lehigh Med Mentors": "The Med Mentors are pre-health juniors and seniors who have been selected and trained to provide peer mentoring for pre-health students. Med Mentors are paired with first-year or transfer students who are interested in health careers. Med Mentors provide knowledge about their own health profession journey and how to navigate being pre-health at Lehigh.Website: https://careercenter.lehigh.edu/Contact: aum221@lehigh.edu (Autumn Moser, Associate Director, Pre-Professional Advising)Timeline: Commit for one full year (summer - spring)Cost/Funding: No cost, volunteerCreditNoDurationOne full year (summer - spring)Work Study OfferedNoFinancial Aid AvailableNoGPA Minimum RequiredYesGPA Requirement3.20PeriodSummerWinterFallSpringCollegeCollege of Arts and SciencesCollege of EducationCollege of BusinessCollege of HealthP.C. Rossin College of Engineering & Applied ScienceIntercollegiate ProgramsEligibilityJuniorSeniorGraduate StudentOpportunity TypePeer MentoringLeadership DevelopmentFunding / CompensationNo CompensationVolunteer",
    "Lehigh University Student Scholars Institute (LUSSI) Student Guides": "LUSSI Program Student Guides are peer mentors in the program that supports F1RST+ students in the cohort base program, starting with structures 1st year programming. Student Guides work in pairs to support 20-25 students by facilitating monthly one-on-one meetings, bi-monthly \"family meetings\", connect students with faculty and staff mentors in the program as well as resources across the university and support events organized by the Center for Student Access and Success. The role begins with training prior to the start of the program in August, followed by pre-orientation for the program participants and an academic year of engagement with the 1st year student participants.Website: https://diversityandinclusion.lehigh.edu/studentsuccess/lussiContact: Center for Student Access and Success, inlusas@lehigh.eduTimeline: Apply in March/April for following academic yearCost/Funding: This opportunity qualifies for work study for Student Guides CreditNoDurationAcademic yearDeadline to ApplyMarch 4, 2024Work Study OfferedYesFinancial Aid AvailableNoGPA Minimum RequiredYesGPA Requirement3.00PeriodFallSpringSummerWinterCollegeCollege of Arts and SciencesCollege of BusinessCollege of HealthP.C. Rossin College of Engineering & Applied ScienceIntercollegiate ProgramsEligibilityFirst YearSophomoreJuniorSeniorOpportunity TypeLeadership DevelopmentPeer MentoringFunding / CompensationWork Study",
    "Lehigh University Student Senate ": "Lehigh University Student Senate is Lehigh's undergraduate student government. Student Senate is responsible for allocating funds and approving and sponsoring clubs on campus, tangibly improving student wellbeing, and serves as the backbone of Lehigh University's undergraduate experience. Student Senate represents every student at Lehigh and is the imperative connection between student voices and Lehigh administration.Website: https://studentsenate.lehigh.edu Contact: insen@lehigh.edu, @lehighsenate on InstagramTimeline: Apply by September 1st for academic year Cost/Funding: No cost to students Executive Board:President, Kevin DotelVice President of Communications, Sterling SalminiVice President of Finance, Kaithlyn HendricksVice President of Internal Affairs, Emily WegrzynVice President of Leadership, Kate Lyden CreditNoWork Study OfferedNoFinancial Aid AvailableNoGPA Minimum RequiredNoPeriodFallSpringCollegeCollege of Arts and SciencesCollege of BusinessCollege of HealthP.C. Rossin College of Engineering & Applied ScienceIntercollegiate ProgramsEligibilityFirst YearSophomoreJuniorSeniorOpportunity TypeCommunity EngagementLeadership DevelopmentPeer MentoringFunding / CompensationNo CompensationVolunteer",
    "Lehigh Valley Social Impact Fellowship": "Lehigh Valley Social Impact Fellows are a cohort of undergraduate and graduate students who address social and economic challenges in the south Bethlehem community and broader Lehigh Valley region. LVSIFs advance their projects in the Spring and Fall semesters and have the option of working on their project in the summer at Mountaintop. The courses, workshops, retreats, and immersive experiences of this program integrate experiential learning, research, and entrepreneurial engagement with students leading original and ambitious projects with local partners. Projects are mentored by Lehigh faculty with students making substantial intellectual contributions along the way.Website: https://creativeinquiry.lehigh.edu/mountaintop-programs/lehigh-valley-social-impact-fellowshipContact: Bill Whitney, wrw210@lehigh.eduTimeline: Application deadline is 11:59pm ET on Sunday, October 29th. Two semesters (Spring followed by Fall). 3 Academic Credits per semester for two semesters. Cost/Funding: No cost to students   CreditYesCredit InfoTotal 6 - 3 per semester for two semestersDeadline to ApplyOctober 29, 2023Application LinkImpact Fellowship 2024 ApplicationWork Study OfferedNoFinancial Aid AvailableNoGPA Minimum RequiredNoPeriodFallSpringCollegeCollege of Arts and SciencesCollege of EducationCollege of BusinessCollege of HealthP.C. Rossin College of Engineering & Applied ScienceIntercollegiate ProgramsEligibilityFirst YearSophomoreJuniorSeniorGraduate StudentOpportunity TypeCommunity EngagementCreative InquiryEntrepreneurshipGlobal & Cross CulturalResearchFunding / CompensationAcademic Credit",
    "Lehigh Ventures Lab": "Powered by the College of Business and the Baker Institute for Entrepreneurship Lehigh Ventures Lab is the most direct support ever offered to Lehigh founders. Available to current students, faculty members and recent alum with advanced externally rationalized business ideas. If you have an earlier stage idea check out EUREKA! for early stage venture idea support.Website: https://www.lehighventureslab.com/Contact: inlvl@lehigh.eduTimeline: Rolling deadline to apply Cost/Funding: No cost, funding available CreditYesCredit Info1-3 credit variable independent study available upon requestDuration6 - 12 monthsWork Study OfferedNoFinancial Aid AvailableNoGPA Minimum RequiredYesGPA Requirement2.00PeriodFallSpringSummerWinterCollegeCollege of Arts and SciencesCollege of BusinessCollege of HealthP.C. Rossin College of Engineering & Applied ScienceIntercollegiate ProgramsEligibilityFirst YearSophomoreJuniorSeniorGraduate StudentOpportunity TypeEntrepreneurshipLeadership DevelopmentFunding / CompensationFunded Expenses",
    "Lehigh@NasdaqCenter Innovation Internship": "Lehigh@NasdaqCenter Innovation Internship is a cutting-edge academic program that immerses students in part-time, real-world internships with startups. Students spend the semester working remotely on real projects with real impact while connecting with Silicon Valley leaders through a weekly class session. Lehigh@NasdaqCenter Innovation Internship (BUS-178) is a 3-credit course available to rising sophomores, juniors, seniors, and graduate students across the university – any major can apply! The course and internship runs August 26 - December 6, 2024.During this 15-week internship (August 26 - December 6, 2024), students gain practical experience by spending 10-15 hours per week interning with a startup, developing their entrepreneurial mindset and skills. Students selected into the program are paired with startups across various industries as they work alongside founders and business leaders on mission-critical projects. Interns add meaningful value and produce a number of resume-ready deliverables for the company.The internship is facilitated through a 3-credit course, led by Lehigh@NasdaqCenter, that meets weekly on Fridays (via Zoom) from 1:35 pm - 4:15 pm ET. The weekly class session features Silicon Valley entrepreneurs and industry leaders. This enables students to put classroom knowledge into action in real-world business environments while expanding their skill sets and network. Website: https://nasdaqcenter.lehigh.edu/student-programs/lehighnasdaqcenter-innovation-internshipContact: Sarah Leedberg, Assistant Director, Innovation Programs sel523@lehigh.eduTimeline: Internships run for the spring and fall semester. Apply for Fall 2024 by April 19th. Cost/Funding: No cost  CreditYesCredit Info3 creditsDuration15 weeksDeadline to ApplyApril 19, 2024Application LinkFall 2024 Application - Lehigh@NasdaqCenter Innovation InternshipWork Study OfferedNoFinancial Aid AvailableNoGPA Minimum RequiredNoPeriodFallCollegeCollege of Arts and SciencesCollege of BusinessCollege of HealthP.C. Rossin College of Engineering & Applied ScienceIntercollegiate ProgramsEligibilitySophomoreJuniorSeniorGraduate StudentOpportunity TypeEntrepreneurshipLeadership DevelopmentWork-Integrated LearningFunding / CompensationAcademic Credit",
    "LehighSiliconValley": "LehighSiliconValley is the Baker Institute's flagship week-long winter term program immersing students in the San Francisco Bay Area entrepreneurial ecosystem.Website: https://www.lehighbakerinstitute.com/lsvprogramdetailsContact: bakerinfo@lehigh.eduTimeline: Application due October 13, 8AM EST. Program runs full-time for 1 day on-campus, 3 days remote and 5 days in-person in San Francisco. Cost: ~$5000 plus airfare, financial aid available CreditYesDurationFull time for 1 day on campus, 3 days remote and 5 days in person. Deadline to ApplyOctober 13, 2023Work Study OfferedNoFinancial Aid AvailableYesGPA Minimum RequiredNoPeriodWinterCollegeCollege of Arts and SciencesCollege of BusinessCollege of HealthP.C. Rossin College of Engineering & Applied ScienceIntercollegiate ProgramsEligibilitySophomoreJuniorSeniorGraduate StudentOpportunity TypeEntrepreneurshipFunding / CompensationAcademic Credit",
    "LU/UN Youth Representative Program": "Founded in 2008, Lehigh University's United Nations Youth Representative Program matches UN-accredited NGOs with high-achieving undergraduate and graduate students who serve as that NGO’s voice at the United Nations. Youth Representatives meet with global decision makers, participate in international conferences, and moderate briefings broadcast worldwide. Our Youth Representatives speak on the floor of the General Assembly and advocate on a variety of platforms related to agenda at the United Nations and worldwide.Website: https://global.lehigh.edu/un-partnership/youth-representative-programContact: Elena Reiss -  elr312@lehigh.eduTimeline: 1 academic year with the option to extend based on performanceCost/Funding: While some financial support is available, participants are encouraged to seek additional funding sources for conferences, UN trips, etc. CreditYesCredit InfoYes, 1-3 credits as per academic advisorDuration1 academic year with the option to extend based on performanceWork Study OfferedNoFinancial Aid AvailableNoGPA Minimum RequiredYesGPA Requirement3.20PeriodFallSpringCollegeCollege of Arts and SciencesCollege of BusinessCollege of HealthP.C. Rossin College of Engineering & Applied ScienceIntercollegiate ProgramsEligibilityFirst YearSophomoreJuniorGraduate StudentOpportunity TypeCreative InquiryGlobal & Cross CulturalLeadership DevelopmentFunding / CompensationFunded ExpensesNo CompensationVolunteer",
    "LUAG Lab": "Located in the Main Galleries at Lehigh University Art Galleries, the LUAG LAB is an interdisciplinary student project and exhibition space that features the research of Lehigh University students from different disciplines. With mentorship from LUAG staff and faculty, students are guided through the experience - from exhibition design to budgeting, installation, promotion, programming, and more.Website: https://luag.lehigh.edu Contact: Elise Schaffer, ejs421@lehigh.eduTimeline: Deadlines are dependent on semester. Exhibitions run for the duration of the fall and spring semesters. Cost/Funding: No cost to students, funded expenses  CreditNoWork Study OfferedNoFinancial Aid AvailableNoGPA Minimum RequiredNoPeriodFallSpringCollegeCollege of Arts and SciencesCollege of EducationCollege of BusinessCollege of HealthP.C. Rossin College of Engineering & Applied ScienceIntercollegiate ProgramsEligibilityFirst YearSophomoreJuniorSeniorGraduate StudentOpportunity TypeArtsFunding / CompensationFunded Expenses",
    "Marcon Fellows": "The Marcon Institute was established through a gift from Charlie Marcon in 2021. The Institute’s core activity is to prepare and deploy scholars, the Marcon Fellows, who show dedication to research that influences perspectives, practices, and policies on racial justice. Students selected as Marcon Fellows will spend the summer working on faculty-led projects in the areas of social justice, race, and racism in the Lehigh Valley. The ideal project would involve a small group of students working in a way that connects with a Lehigh Valley community organization to enhance the work of that organization in social justice, anti-racism, or related areas. Selected students will earn $4,000 each for ten weeks.Website: https://marcon.lehigh.edu/you-belong-hereContact: marconinst@lehigh.eduTimeline: Apply in March for following summer. 10 week summer intensive. Cost/Funding: $4000 stipend for summer intensive. Academic credit offered for semester or annual fellowship. CreditYesWork Study OfferedNoFinancial Aid AvailableNoGPA Minimum RequiredNoPeriodSummerWinterFallSpringCollegeCollege of Arts and SciencesCollege of EducationCollege of BusinessCollege of HealthP.C. Rossin College of Engineering & Applied ScienceIntercollegiate ProgramsEligibilityFirst YearSophomoreJuniorSeniorGraduate StudentOpportunity TypeGlobal & Cross CulturalResearchCommunity EngagementLeadership DevelopmentArtsFunding / CompensationStipendAcademic Credit",
    "Martindale Student Associates Honors Program": "The Martindale Student Associates enables a select group of 12 Lehigh juniors and seniors--from across Lehigh's four undergraduate colleges--to explore business, economic, social and public policy issues outside their scope of classroom study. Students travel internationally to the place of research and participate in meetings and discussions with thought leaders from government, business, social, academic and research institutions. The 15-month program is fully funded and participants conduct research and write solo-authored academic articles pertaining to the country to become published authors before they graduate.Website: https://business.lehigh.edu/centers/martindale-center/programs/martindale-student-associates-honors-programContact: Todd Watkins, Executive Director, taw4@lehigh.edu and Trisha Alexy, Program Manager, tsa2@lehigh.edu, 610-533-6262Timeline: Students apply in the winter of their junior year. Program runs spring semester junior year through spring semester senior year, including 2 weeks summer travel in May between junior and senior year.Cost/Funding: $0 Cost to Student, Fully funded program CreditYesCredit Info3 creditsDeadline to ApplyFebruary 2, 2024Work Study OfferedNoFinancial Aid AvailableNoGPA Minimum RequiredYesGPA Requirement3.40PeriodFallSpringSummerCollegeCollege of Arts and SciencesCollege of BusinessCollege of HealthP.C. Rossin College of Engineering & Applied ScienceIntercollegiate ProgramsEligibilityJuniorOpportunity TypeCommunity EngagementCreative InquiryGlobal & Cross CulturalLeadership DevelopmentPeer MentoringResearchWork-Integrated LearningFunding / CompensationFunded Expenses",
    "Mentor Collective": "Website: https://diversityandinclusion.lehigh.edu/studentsuccess/mentor-collectiveContact: Center for Student Access and Success, inlusas@lehigh.edu Timeline: Recruitment begins in April/May, continues as rolling into the Fall semesterCost/Funding: Volunteer opportunity - no cost to students CreditNoWork Study OfferedNoFinancial Aid AvailableNoGPA Minimum RequiredNoPeriodFallSpringSummerWinterCollegeCollege of Arts and SciencesCollege of BusinessCollege of HealthP.C. Rossin College of Engineering & Applied ScienceIntercollegiate ProgramsEligibilitySophomoreJuniorSeniorOpportunity TypeLeadership DevelopmentPeer MentoringFunding / CompensationVolunteer",
    "Mountaintop Summer Experience": "Mountaintop Summer Experience projects are interdisciplinary deep dives where faculty, students, and external partners come together and take new intellectual, creative, and/or artistic pathways that lead to transformative new innovations, new expressions, and new questions. We expect students to take radical ownership in their projects, and envision faculty mentors as partners and co-creators striving to propel their projects forward on the journey towards tangible, sustainable impact: impact which builds the skillsets, mindsets, and portfolios of pioneers and change-makers in a rapidly changing world.Website: https://creativeinquiry.lehigh.edu/mountaintop-programs/mountaintop-summer-experienceContact: Bill Whitney, wrw210@lehigh.eduTimeline: Apply in late March for following summer. Program runs for 10 weeks (late May through early August). Cost/Funding: Stipend provided for Fellows. Lunch provided each weekday for Fellows and Associates.  CreditNoWork Study OfferedNoFinancial Aid AvailableNoGPA Minimum RequiredNoPeriodSummerCollegeCollege of Arts and SciencesCollege of EducationCollege of BusinessCollege of HealthP.C. Rossin College of Engineering & Applied ScienceIntercollegiate ProgramsEligibilityFirst YearSophomoreJuniorSeniorGraduate StudentOpportunity TypeCreative InquiryEntrepreneurshipResearchCommunity EngagementFunding / CompensationStipendNo Compensation",
    "Music Ensembles ": "Music Ensembles both for credit and not for credit include the Marching 97, Wind Ensemble, Symphonic Band, Jazz Ensemble, Jazz Orchestra, Jazz Combos, University Choir, Treble Choir (Dolce), Tenor/Bass Choir-Glee Club, Choral Union, Lehigh University Philharmonic, Chamber Music. These groups meet regularly to rehearse, give public concerts, and include student management and leadership opportunities.Website: https://music.cas.lehigh.edu/content/ensembles Contact: Paul SalerniTimeline: Some groups have auditions at the beginning of the school year; others require no audition, but each ensemble is a credited course and starts in the first week of class of any given semester. Option for 1 credit per ensemble, or 0 credit.Cost/Funding: No cost to students, two merit scholarships available: the Performing Arts Scholarship and Snyder ScholarshipsCreditYesWork Study OfferedNoFinancial Aid AvailableYesGPA Minimum RequiredNoPeriodFallSpringCollegeCollege of Arts and SciencesCollege of EducationCollege of BusinessCollege of HealthP.C. Rossin College of Engineering & Applied ScienceIntercollegiate ProgramsEligibilityFirst YearSophomoreJuniorSeniorGraduate StudentOpportunity TypeCreative InquiryGlobal & Cross CulturalEntrepreneurshipCommunity EngagementLeadership DevelopmentArtsFunding / CompensationAcademic Credit",
    "Office of International Affairs Summer Fellowship Program": "Office of International Affairs Summer Fellowship Program is a paid summer fellowship that introduces Lehigh students to careers in international education. Fellows work full time in Lehigh's Office of International Affairs (OIA), rotating through the OIA programs and offices to gain an in-depth insight on each area's functions and explore possible career paths in the field of international education. The program is open to Lehigh undergraduates in any college or major.Website: https://global.lehigh.edu/oia-summer-fellows Contact: ane319@lehigh.eduTimeline: Apply in March for following summer. 8-week full-time summer program. Cost/Funding: $4000 stipend CreditNoStart and End DateJune 2, 2024 - July 27, 2024Deadline to ApplyMarch 24, 2024Work Study OfferedNoFinancial Aid AvailableYesGPA Minimum RequiredNoPeriodSummerCollegeCollege of Arts and SciencesCollege of BusinessCollege of HealthP.C. Rossin College of Engineering & Applied ScienceIntercollegiate ProgramsEligibilityFirst YearSophomoreJuniorSeniorOpportunity TypeGlobal & Cross CulturalLeadership DevelopmentWork-Integrated LearningFunding / CompensationStipend",
    "Office of Residence Life Gryphon Society ": "The Gryphon is a paraprofessional, undergraduate student staff member of the Office of Residence Life. The Gryphon plays a vital role in facilitating an atmosphere of community upon a specific building or area (depending on their assignment). The Gryphon receives direct supervision from an Assistant Director or Graduate Assistant, and the Associate Director(s) provides indirect supervision.Website: https://studentaffairs.lehigh.edu/content/gryphon-society Contact: gryphon@lehigh.eduTimeline: Application opens in October and closes in early November for the following academic year. Gryphons commit for the entire academic year (August-May). There are limited positions available over the summer for current Gryphons.Cost/Funding: Single room, stipend of $3010 distributed biweekly  CreditNoDurationAugust-May (entire academic year); Fall, Winter, & Spring semestersDeadline to ApplyNovember 3, 2023Work Study OfferedNoFinancial Aid AvailableNoGPA Minimum RequiredYesGPA Requirement2.50PeriodFallSpringSummerCollegeCollege of Arts and SciencesCollege of EducationCollege of BusinessCollege of HealthP.C. Rossin College of Engineering & Applied ScienceIntercollegiate ProgramsEligibilitySophomoreJuniorSeniorGraduate StudentOpportunity TypeCommunity EngagementLeadership DevelopmentPeer MentoringFunding / CompensationStipendFunded Expenses",
    "Orientation Leader, OFYE Staff": "An Orientation Leader serves as a resource for the academic and social transition for first-year students on the OFYE Staff. They participate in Spring and Summer training, guide students through 4 days of Orientation and serve as support throughout the fall in their role in NavigateLU.Website: https://studentaffairs.lehigh.edu/content/be-orientation-leader Contact: Nicole Burke, nmb518@lehigh.eduTimeline: Apply by Friday, January 26 at 12 noon. Commitment for training in spring 2024, orientation in August 2024 and NavigateLU in fall 2024. Cost/Funding: Volunteer opportunity - no cost to student, training provided CreditNoDeadline to ApplyJanuary 26, 2024Work Study OfferedNoFinancial Aid AvailableNoGPA Minimum RequiredYesGPA Requirement2.50PeriodSummerFallSpringCollegeCollege of Arts and SciencesCollege of BusinessCollege of HealthP.C. Rossin College of Engineering & Applied ScienceIntercollegiate ProgramsEligibilityFirst YearSophomoreJuniorOpportunity TypePeer MentoringLeadership DevelopmentFunding / CompensationNo CompensationVolunteer",
    "Peer Health Advisors": "The Peer Health Advisors are students trained by Health Advancement & Prevention Strategies staff members and other campus experts to help advance the health and safety of their peers at Lehigh University. Peer Health Advisors provide peer-to-peer support, advice, resources and programming to promote health behaviors.Website: https://studentaffairs.lehigh.edu/content/peer-health-advisors Contact: inhaps@lehigh.edu / Jenna RoseTimeline: Apply by October 8, 2023  Cost/Funding: Volunteer opportunity. 4-credit class in the spring semester is a prerequisite to join the organization. CreditYesDeadline to ApplyOctober 15, 2023Work Study OfferedNoFinancial Aid AvailableNoGPA Minimum RequiredNoPeriodFallSpringCollegeCollege of Arts and SciencesCollege of BusinessCollege of HealthP.C. Rossin College of Engineering & Applied ScienceIntercollegiate ProgramsEligibilityFirst YearSophomoreJuniorOpportunity TypeCreative InquiryEntrepreneurshipResearchPeer MentoringCommunity EngagementWork-Integrated LearningLeadership DevelopmentFunding / CompensationAcademic CreditVolunteer",
    "Rapidly Accelerated Research Experience (RARE)": "Rapidly Accelerated Research Experience (RARE) is a focused pre-admission-to-graduation STEM (Science, Technology, Engineering, and Mathematics) immersion program. The overarching goal of the program is to provide opportunities for students from backgrounds underrepresented in STEM fields to develop outstanding scientific skills in an environment that emphasizes preparation for leadership in addressing the increasingly complex issues facing the sciences, engineering, and society in the 21st century.Website: https://hhmi.cas.lehigh.edu/content/rareContact: Neal Simon (ngs0) and Vassie Ware (vcw0) Timeline: Students must apply after admission in the spring and before enrollment Cost/Funding: No cost - stipends, work study, research credit and funded expenses offeredCreditNoDurationThroughout undergraduate yearsWork Study OfferedNoFinancial Aid AvailableYesGPA Minimum RequiredNoPeriodSummerFallSpringCollegeCollege of Arts and SciencesCollege of HealthP.C. Rossin College of Engineering & Applied ScienceEligibilityFirst YearOpportunity TypeCreative InquiryEntrepreneurshipResearchFunding / CompensationStipendWork StudyAcademic CreditFunded Expenses",
    "Reserve Officers' Training Corps (ROTC)": "The Reserve Officers' Training Corps (ROTC) is a college program offered at more than 1,700 colleges and universities across the United States that prepares young adults to become officers in the U.S. Military. Website: https://studentaffairs.lehigh.edu/content/military-science-and-leadership-rotcContact: 610-758-3272Timeline: ROTC follows RAS add/drop deadlines. Army scholarship deadlines differ.Cost/Funding: No additional fees. Must be a registered student. Scholarships available. Contracted Cadets receive $420.00 a month during the academic school year. Academic credit offered. The number of credits accepted towards a major may differ. Levels: Freshman 1 credit; Sophomore 1; Junior 2; Senior 3. This is a 4 year program so a class in each level must be completed. Graduate students are eligible if they have a min of 2 years available to pursue ROTC courses. CreditYesWork Study OfferedNoFinancial Aid AvailableNoGPA Minimum RequiredYesGPA Requirement2.00PeriodFallSpringCollegeCollege of Arts and SciencesCollege of EducationCollege of BusinessCollege of HealthP.C. Rossin College of Engineering & Applied ScienceIntercollegiate ProgramsEligibilityFirst YearSophomoreJuniorSeniorGraduate StudentOpportunity TypeLeadership DevelopmentFunding / CompensationStipend",
    "Rossin Junior Fellows": "Rossin Junior Fellows are undergraduate students who serve as ambassadors for the P.C. Rossin College of Engineering and Applied Science. These students help with recruiting efforts and peer mentoring, foster professional development and promote STEM on campus and in the local community. Website: https://engineering.lehigh.edu/meche/undergraduate/rossin-junior-fellows Contact: Robin Armbruster, rma2@lehigh.eduTimeline: Students selected through department nomination during the spring semester Cost/Funding: Volunteer opportunity - no cost to student CreditNoWork Study OfferedNoFinancial Aid AvailableNoGPA Minimum RequiredNoPeriodSummerFallSpringCollegeP.C. Rossin College of Engineering & Applied ScienceEligibilitySophomoreJuniorSeniorOpportunity TypePeer MentoringCommunity EngagementLeadership DevelopmentFunding / CompensationVolunteer",
    "Silicon Valley Social Impact Fellowship": "Silicon Valley Social Impact Fellows are a cohort of undergraduate and graduate students who address social and economic challenges in the fast-growing and ever-changing tech hubs of the San Francisco Bay Area and Silicon Valley. SVSIFs advance their projects in the Spring and Fall semesters, with 2-3 weeks of fieldwork in the Bay Area during the summer. The courses, workshops, retreats, and immersive experiences of this program integrate experiential learning, research, and entrepreneurial engagement with students leading original and ambitious projects with partners on campus and across the region. Projects are mentored by Lehigh faculty with students making substantial intellectual contributions along the way.Website: https://creativeinquiry.lehigh.edu/mountaintop-programs/silicon-valley-social-impact-fellowshipContact: Bill Whitney, wrw210@lehigh.eduTimeline: Application deadline is 11:59pm ET on Sunday, October 29th. Program runs for two semesters (Spring followed by Fall) with fieldwork typically taking place in late May/early June.Cost/Funding: Approx. $500 needed for fieldwork. Financial assistance available for most students. 3 Academic Credits per semester for two semesters.  CreditYesDeadline to ApplyOctober 29, 2023Application LinkImpact Fellowship 2024 ApplicationWork Study OfferedNoFinancial Aid AvailableYesGPA Minimum RequiredNoPeriodFallSpringSummerCollegeCollege of Arts and SciencesCollege of EducationCollege of BusinessCollege of HealthP.C. Rossin College of Engineering & Applied ScienceIntercollegiate ProgramsEligibilityFirst YearSophomoreJuniorSeniorGraduate StudentOpportunity TypeCommunity EngagementCreative InquiryEntrepreneurshipGlobal & Cross CulturalResearchFunding / CompensationAcademic CreditFunded Expenses",
    "Startup Academy": "Startup Academy is a cutting-edge, fully funded academic program that immerses students in full-time, real-world internships with startups. Students spend the summer living and working together in Silicon Valley – the global hub of entrepreneurship and innovation – working on real projects with real impact.Website: https://nasdaqcenter.lehigh.edu/student-programs/startup-academyContact: Sam Dewalt, Managing Director, Lehigh@NasdaqCenter/Sarah Leedberg, Assistant Director, Innovation Programs/ Marina Odierno, Associate Director of Professional Development, College of BusinessTimeline: Application due Monday, November 20, 2023Cost: This program is fully funded. The students are provided housing and a meal plan in addition to a $4500 stipend intended to cover the one credit tuition, air fair, and incidentals.CreditYesCredit Info1 credit - BUS 173Duration10 weeksDeadline to ApplyNovember 20, 2023Work Study OfferedNoFinancial Aid AvailableNoGPA Minimum RequiredNoPeriodSummerCollegeCollege of Arts and SciencesCollege of BusinessCollege of HealthP.C. Rossin College of Engineering & Applied ScienceIntercollegiate ProgramsEligibilitySophomoreJuniorSeniorGraduate StudentOpportunity TypeEntrepreneurshipWork-Integrated LearningLeadership DevelopmentFunding / CompensationStipendAcademic Credit",
    "The Hatchery: Student Idea Accelerator": "The Hatchery, run by the Baker Institute for Entrepreneruship Creativity and Innovation, is a place to create new ideas and hatch those ideas into early stage businesses to be supported in EUREKA! and other programs. The Hatchery Summer Intensive specifically is a full time six week program for participants to focus on the advancement of their ideas through direct content, coaching, and inspiring guests.Website: https://www.lehighbakerinstitute.com/hatcheryContact: bakerinfo@lehigh.eduTimeline: Early Action Applications Due March 11 @ 9AM, Regular Applications Due March 25 @ 9AMCost/Funding: No cost program, with housing stipends for those with qualifying financial need. Can apply for project funding through EUREKA! while in the Hatchery.   CreditNoDuration5 weeksStart and End DateJuly 1, 2024 - August 6, 2024Deadline to ApplyMarch 25, 2024Application LinkHatchery 2024 ApplicationWork Study OfferedNoFinancial Aid AvailableYesGPA Minimum RequiredYesGPA Requirement2.00PeriodSummerCollegeCollege of Arts and SciencesCollege of BusinessCollege of HealthP.C. Rossin College of Engineering & Applied ScienceIntercollegiate ProgramsEligibilityFirst YearSophomoreJuniorSeniorGraduate StudentOpportunity TypeEntrepreneurshipFunding / CompensationFunded Expenses",
    "Theatre Productions": "The Department of Theatre thrives on collaborative creativity, uniting students, faculty, staff, and guest artists. The heart of our performances is the 300-seat Diamond Theater at the Zoellner Arts Center, featuring predominantly student actors under faculty or guest artist direction. Occasionally, exceptional students have the opportunity to direct or design. Additionally, we host professional performers and have a creative space in the intimate Black Box Theater at Zoellner, fostering a close-knit and distinctive theater community.Website: https://theatre.cas.lehigh.edu/content/theatre-department-lehighContact: Kashi JohnsonTimeline: Rolling deadlines to apply. Cost/Funding: The department grants a variable number of performing arts scholarships to incoming first year students each year.  CreditYesCredit InfoOn average 2, but in more involved productions students can recieve up to 4 credits.Duration2 semestersWork Study OfferedNoFinancial Aid AvailableNoGPA Minimum RequiredNoPeriodFallSpringCollegeCollege of Arts and SciencesCollege of EducationCollege of BusinessCollege of HealthP.C. Rossin College of Engineering & Applied ScienceIntercollegiate ProgramsEligibilityFirst YearSophomoreJuniorSeniorGraduate StudentOpportunity TypeCreative InquiryGlobal & Cross CulturalCommunity EngagementLeadership DevelopmentArtsFunding / CompensationAcademic Credit",
    "TRAC Writing Fellows Program": "Based on the tried-and-true notion that collaboration among peers is one of our most effective methods of learning, the TRAC Writing Fellows Program at Lehigh University is committed to promoting a campus-wide culture in which writing and communication in its many forms are central to learning. In this culture, communication and inquiry are vitally linked, restraints on learning imposed by traditional disciplinary boundaries are eased, and students and faculty are all part of one vibrant intellectual community.Contact: intrac@lehigh.eduTimeline: Application due in April, students commit on a semester-basis Cost/Funding: No cost to student, academic credit and stipends offeredCreditYesDeadline to ApplyApril 2, 2024Application LinkTRAC Fellow Application Spring 2024Work Study OfferedNoFinancial Aid AvailableNoGPA Minimum RequiredYesGPA Requirement3.20PeriodFallSpringCollegeCollege of Arts and SciencesCollege of BusinessCollege of HealthP.C. Rossin College of Engineering & Applied ScienceIntercollegiate ProgramsEligibilityFirst YearSophomoreJuniorOpportunity TypeLeadership DevelopmentPeer MentoringFunding / CompensationStipendAcademic Credit",
    "Uganda Sustainable Livelihoods Program": "Uganda Sustainable Livelihoods Program is a research & internship based program in Bududa, Uganda. Students can intern at local organizations, including Pathways Development Initiative, which has a primary school and youth sports and tutoring programs, or Zion Community Clinic, where students can shadow medical staff and assist with public health outreach. Students can also conduct social research under the direction of Professor Austin on topics related to health, educaiton, the environment, women's empowerment, or community development.Contact: Professor Kelly Austin (kellyaustin@lehigh.edu)Timeline: Application due November 30, 2023, program runs for 4.5 weeks or 7.5 weeks over the summerCost/Funding: Students typically apply for full funding through the Iacocca International Internship Program or other sources.  CreditNoDeadline to ApplyNovember 30, 2023Work Study OfferedNoFinancial Aid AvailableNoGPA Minimum RequiredNoPeriodSummerCollegeCollege of Arts and SciencesCollege of BusinessCollege of HealthP.C. Rossin College of Engineering & Applied ScienceIntercollegiate ProgramsEligibilityFirst YearSophomoreJuniorSeniorOpportunity TypeCommunity EngagementGlobal & Cross CulturalLeadership DevelopmentResearchWork-Integrated LearningFunding / CompensationFunded ExpensesVolunteer"
}